[
  {
    "text": "Smith & Wesson J-Frame revolvers have had your back since 1950. These small revolvers were designed to fire a full power round and are as simple and easy to use as they are reliable. Available in various calibers and with three diverse hammer designs, it is no surprise that the Smith & Wesson J-Frame has become the most popular, small-frame, defense revolver on the market. The Model 442 is the latest innovation of the Model 42 Centennial Airweight, a lightweight aluminum alloy revolver with a fully concealed hammer. Beautifully enhanced with diamond-tipped machine tool scroll engravings on the frame and cylinder, the Model 442 integrates the time-tested features of the original with modern advancements.",
    "title": "Smith & Wesson 442 .38 Special Revolver,",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/smith-wesson-442-38-special-revolver-1-875-barrel-fixed-sights-blue-150785.html",
    "tags": ["pistol", "38", "revolver"]
  },
  {
    "text": "The Smith & Wesson L-Frame is specifically engineered for continuous Magnum ammunition use. Its strong frame and barrel construction ensure long-lasting performance, making it a preferred choice for demanding shooters, including police officers and hunters. This reliable firearm features a 6-shot cylinder and a corrosion-resistant satin stainless finish.",
    "title": "Smith & Wesson Model 686 .357 Magnum/.38 Special +P Stainless Steel Revolver 164224",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/",
    "tags": ["pistol", "38", "357", "stainless", "revolver"]
  },
  {
    "text": "Introducing the \"CHRONICLE 1911\" by GForce Arms—a stunning fusion of classic craftsmanship and modern innovation. This legendary 1911 handgun has been redefined to deliver the timeless reliability you've come to expect, coupled with the advanced features you deserve. Built with meticulous precision from high-quality materials, the CHRONICLE 1911 raises the bar in firearm excellence. At its core, the CHRONICLE 1911 features a barrel, frame, and slide expertly forged from 4140 steel and high-grade aluminum. The barrel boasts advanced button rifling for exceptional accuracy, while the durable frame and slide provide unwavering performance in any environment. Weighing just 2.2 pounds, this handgun offers the ideal balance of strength and agility, making it a top choice for both personal defense and target shooting.",
    "title": "G-Force Chronicle 1911 45ACP 5' 8rd Pistol, Walnut / Black - GF1945BW",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/g-force-chronicle-1911-45acp-5-8rd-pistol-walnut-black-gf1945bw.html",
    "tags": ["pistol", "1911", "45 ACP", "wood"]
  },
  {
    "text": "Dan Wesson makes its Heirloom pistols in small batches, producing hundreds, not thousands, of the classic 1911. The pistol's timeless styling and proven design make the traditional 1911 pistol something every gun enthusiast will love. Though there are many manufacturers of 1911s, only a few combine custom-level fitting, premium parts, and clean, elegant lines like a Dan Wesson.",
    "title": "Dan Wesson Pistol 1911 Heirloom 2024 45acp 8rd 4.25\" - 01779",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/dan-wesson-pistol-1911-heirloom-2024-45acp-8rd-4-25-01779.html",
    "tags": ["pistol", "1911", "45 ACP", "mohogany"]
  },
  {
    "text": "The Glock® G43X MOS Optics-Ready Semi-Auto Pistol utilizes a single-stacked magazine in 9mm to make it slim and compact, specifically for concealed carry use. Coming in with a slide matching the dimensions of the G43, the G43X features a slightly-larger frame that accommodates a larger round capacity and can fit larger hands more comfortably. Made with the same materials and quality control as all Glock semi-automatic pistols, the G43X is a carry gun with the power of a 9mm field gun that you can count on for survival. Internally, the G43X employs the same striker fired, short-recoil operated, and locked-breech barrel as the larger-framed Glock pistols. The Safe-Action trigger system makes shooting in stressed situations infallible. The textured polymer grip provides a solid hold, and while the G43X MOS is quite concealable, the grip offers shooters enough surface area for ultimate control. The white-dot front sight and the white-bracket rear sight provide rapid acquisition in dim-lighting situations. The length, shape, finger rest, and size of the trigger opening are the same as the larger pistols, and the trigger is the same size, making them all familiar to those who already use Glock pistols. The G43X MOS Semi-Auto Pistol is a reliable, easy to maintain firearm that's perfect for everyday carry. The G43 comes with 2 ultrareliable single-stack magazines.",
    "title": "GLOCK G43x MOS Subcompact Semi-Auto Pistol",
    "source": "basspro",
    "url": "https://www.basspro.com/p/glock-g43x-mos-optics-ready-semi-auto-pistol",
    "tags": ["pistol", "9mm", "glock", "black"]
  },
  {
    "text": "Sig Sauer Cross 277 Sig Fury Black Anodized Bolt Action Rifle - 20in - Utilizing the cartridge technology created for the U.S. Army comes the new SIG SAUER CROSS in 277 SIG FURY. Featuring a Cold Hammer Forged Steel 20in barrel, the CROSS 277 SIG FURY delivers magnum performance in a lightweight package. The increased velocity allows for a faster flight time, leading to reduced effect of environmentals. Offering less bullet drop and more energy on target than a conventional-cased cartridge, the 277 FURY delivers magnum performance in a short action cartridge.",
    "title": "Sig Sauer Cross 277 Sig Fury Black Anodized Bolt Action Rifle - 20in",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/rifles/sig-sauer-cross-277-sig-fury-black-anodized-bolt-action-rifle-20in/p/1901448",
    "tags": ["rifle", "277", "black"]
  },
  {
    "text": "Sig Sauer Rose 9mm Luger 3.1in Black Pistol - 10+1 Rounds - The ROSE P365 kit includes a special edition P365 pistol in 9mm, a custom ROSE Vaultek lockable storage case, and instant access to a complete step-by-step ROSE video training series that allows you to learn at your own pace, along with a ROSE online community to help encourage and inspire you with help and support as you continue to grow as a more confident and comfortable shooter.",
    "title": "Sig Sauer Rose 9mm Luger 3.1in Black Pistol - 10+1 Rounds",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/handguns/sig-sauer-rose-9mm-luger-31in-black-pistol-101-rounds/p/1810963",
    "tags": ["pistol", "gray", "gold", "9mm"]
  },
  {
    "text": "Designed with a manual safety, this Sig Sauer P320 M17 Coyote Manual NS 9mm Full-Sized 17-Round Pistol is crafted with a stainless-steel frame and slide, a 4.7-inch carbon-steel barrel and a modular polymer grip. This pistol features a SIGLITE front night sight, a removable rear night sight plate and an M1913 rail for accessories.",
    "title": "Sig Sauer Rose 9mm Luger 3.1in Black Pistol - 10+1 Rounds - The ROSE P365 kit includes a special edition P365 pistol in 9mm, a custom ROSE Vaultek lockable storage case, and instant access to a complete step-by-step ROSE video training series that allows you to learn at your own pace, along with a ROSE online community to help encourage and inspire you with help and support as you continue to grow as a more confident and comfortable shooter.",
    "source": "academy",
    "url": "https://www.academy.com/p/sig-sauer-p320-m17-coyote-manual-ns-9mm-full-sized-17-round-pistol",
    "tags": ["pistol", "9mm", "dark earth"]
  }
]
