[
  {
    "text": "Smith & Wesson J-Frame revolvers have had your back since 1950. These small revolvers were designed to fire a full power round and are as simple and easy to use as they are reliable. Available in various calibers and with three diverse hammer designs, it is no surprise that the Smith & Wesson J-Frame has become the most popular, small-frame, defense revolver on the market. The Model 442 is the latest innovation of the Model 42 Centennial Airweight, a lightweight aluminum alloy revolver with a fully concealed hammer. Beautifully enhanced with diamond-tipped machine tool scroll engravings on the frame and cylinder, the Model 442 integrates the time-tested features of the original with modern advancements.",
    "title": "Smith & Wesson 442 .38 Special Revolver",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/smith-wesson-442-38-special-revolver-1-875-barrel-fixed-sights-blue-150785.html",
    "tags": ["pistol", "38", "revolver"]
  },
  {
    "text": "The Smith & Wesson L-Frame is specifically engineered for continuous Magnum ammunition use. Its strong frame and barrel construction ensure long-lasting performance, making it a preferred choice for demanding shooters, including police officers and hunters. This reliable firearm features a 6-shot cylinder and a corrosion-resistant satin stainless finish.",
    "title": "Smith & Wesson Model 686 .357 Magnum/.38 Special +P Stainless Steel Revolver 164224",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/",
    "tags": ["pistol", "38", "357", "stainless", "revolver"]
  },
  {
    "text": "Introducing the \"CHRONICLE 1911\" by GForce Arms—a stunning fusion of classic craftsmanship and modern innovation. This legendary 1911 handgun has been redefined to deliver the timeless reliability you've come to expect, coupled with the advanced features you deserve. Built with meticulous precision from high-quality materials, the CHRONICLE 1911 raises the bar in firearm excellence. At its core, the CHRONICLE 1911 features a barrel, frame, and slide expertly forged from 4140 steel and high-grade aluminum. The barrel boasts advanced button rifling for exceptional accuracy, while the durable frame and slide provide unwavering performance in any environment. Weighing just 2.2 pounds, this handgun offers the ideal balance of strength and agility, making it a top choice for both personal defense and target shooting.",
    "title": "G-Force Chronicle 1911 45ACP 5' 8rd Pistol, Walnut / Black - GF1945BW",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/g-force-chronicle-1911-45acp-5-8rd-pistol-walnut-black-gf1945bw.html",
    "tags": ["pistol", "1911", "45 ACP", "wood"]
  },
  {
    "text": "Dan Wesson makes its Heirloom pistols in small batches, producing hundreds, not thousands, of the classic 1911. The pistol's timeless styling and proven design make the traditional 1911 pistol something every gun enthusiast will love. Though there are many manufacturers of 1911s, only a few combine custom-level fitting, premium parts, and clean, elegant lines like a Dan Wesson.",
    "title": "Dan Wesson Pistol 1911 Heirloom 2024 45acp 8rd 4.25\" - 01779",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/dan-wesson-pistol-1911-heirloom-2024-45acp-8rd-4-25-01779.html",
    "tags": ["pistol", "1911", "45 ACP", "mahogany"]
  },
  {
    "text": "The Glock® G43X MOS Optics-Ready Semi-Auto Pistol utilizes a single-stacked magazine in 9mm to make it slim and compact, specifically for concealed carry use. Coming in with a slide matching the dimensions of the G43, the G43X features a slightly-larger frame that accommodates a larger round capacity and can fit larger hands more comfortably. Made with the same materials and quality control as all Glock semi-automatic pistols, the G43X is a carry gun with the power of a 9mm field gun that you can count on for survival. Internally, the G43X employs the same striker fired, short-recoil operated, and locked-breech barrel as the larger-framed Glock pistols. The Safe-Action trigger system makes shooting in stressed situations infallible. The textured polymer grip provides a solid hold, and while the G43X MOS is quite concealable, the grip offers shooters enough surface area for ultimate control. The white-dot front sight and the white-bracket rear sight provide rapid acquisition in dim-lighting situations. The length, shape, finger rest, and size of the trigger opening are the same as the larger pistols, and the trigger is the same size, making them all familiar to those who already use Glock pistols. The G43X MOS Semi-Auto Pistol is a reliable, easy to maintain firearm that's perfect for everyday carry. The G43 comes with 2 ultrareliable single-stack magazines.",
    "title": "GLOCK G43x MOS Subcompact Semi-Auto Pistol",
    "source": "basspro",
    "url": "https://www.basspro.com/p/glock-g43x-mos-optics-ready-semi-auto-pistol",
    "tags": ["pistol", "9mm", "glock", "black"]
  },
  {
    "text": "Sig Sauer Cross 277 Sig Fury Black Anodized Bolt Action Rifle - 20in - Utilizing the cartridge technology created for the U.S. Army comes the new SIG SAUER CROSS in 277 SIG FURY. Featuring a Cold Hammer Forged Steel 20in barrel, the CROSS 277 SIG FURY delivers magnum performance in a lightweight package. The increased velocity allows for a faster flight time, leading to reduced effect of environmentals. Offering less bullet drop and more energy on target than a conventional-cased cartridge, the 277 FURY delivers magnum performance in a short action cartridge.",
    "title": "Sig Sauer Cross 277 Sig Fury Black Anodized Bolt Action Rifle - 20in",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/rifles/sig-sauer-cross-277-sig-fury-black-anodized-bolt-action-rifle-20in/p/1901448",
    "tags": ["rifle", "277", "black"]
  },
  {
    "text": "Sig Sauer Rose 9mm Luger 3.1in Black Pistol - 10+1 Rounds - The ROSE P365 kit includes a special edition P365 pistol in 9mm, a custom ROSE Vaultek lockable storage case, and instant access to a complete step-by-step ROSE video training series that allows you to learn at your own pace, along with a ROSE online community to help encourage and inspire you with help and support as you continue to grow as a more confident and comfortable shooter.",
    "title": "Sig Sauer Rose 9mm Luger 3.1in Black Pistol - 10+1 Rounds",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/handguns/sig-sauer-rose-9mm-luger-31in-black-pistol-101-rounds/p/1810963",
    "tags": ["pistol", "gray", "gold", "9mm"]
  },
  {
    "text": "Designed with a manual safety, this Sig Sauer P320 M17 Coyote Manual NS 9mm Full-Sized 17-Round Pistol is crafted with a stainless-steel frame and slide, a 4.7-inch carbon-steel barrel and a modular polymer grip. This pistol features a SIGLITE front night sight, a removable rear night sight plate and an M1913 rail for accessories.",
    "title": "Sig Sauer P320 M17 Coyote Manual NS 9mm Full-Sized 17-Round Pistol",
    "source": "academy",
    "url": "https://www.academy.com/p/sig-sauer-p320-m17-coyote-manual-ns-9mm-full-sized-17-round-pistol",
    "tags": ["pistol", "9mm", "dark earth"]
  },
  {
    "text": "The Ruger 10/22 has been America's favorite .22 rifle for over 50 years. The rugged rotary magazine provides smooth and reliable feeding, and the cold hammer-forged barrel delivers exceptional accuracy. With its traditional hardwood stock and reliable semi-automatic action, the 10/22 is perfect for plinking, small game hunting, and target shooting.",
    "title": "Ruger 10/22 Carbine Semi-Auto Rifle .22 LR",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/rifles/ruger-1022-carbine-semi-auto-rifle-22-lr/p/1234567",
    "tags": ["rifle", "22", "wood", "semi-auto"]
  },
  {
    "text": "The AR-15 platform continues to evolve with the Smith & Wesson M&P15 Sport III. This rifle features a 16-inch barrel with a 1:8 twist rate, perfect for a wide variety of ammunition. The six-position telescoping stock and A2 flash hider make this an excellent choice for both new and experienced shooters.",
    "title": "Smith & Wesson M&P15 Sport III Semi-Auto Rifle 5.56 NATO",
    "source": "basspro",
    "url": "https://www.basspro.com/p/smith-wesson-mp15-sport-iii-semi-auto-rifle-556-nato",
    "tags": ["rifle", "556", "black", "ar15"]
  },
  {
    "text": "The Mossberg 500 is one of the most popular shotguns in America, known for its reliability and versatility. This 12-gauge pump-action shotgun features a 28-inch barrel and comes with interchangeable choke tubes for various hunting and sporting applications. The dual extractors and twin action bars ensure smooth cycling.",
    "title": "Mossberg 500 Field 12 Gauge Pump-Action Shotgun",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/mossberg-500-field-12-gauge-pump-action-shotgun",
    "tags": ["shotgun", "12 gauge", "pump", "hunting"]
  },
  {
    "text": "The Remington 700 has been the gold standard for precision rifles for decades. This bolt-action rifle in .30-06 Springfield features a 24-inch barrel and delivers exceptional accuracy. The X-Mark Pro trigger system provides a crisp, clean break, making it ideal for hunting and long-range shooting.",
    "title": "Remington 700 ADL Bolt-Action Rifle .30-06 Springfield",
    "source": "academy",
    "url": "https://www.academy.com/p/remington-700-adl-bolt-action-rifle-30-06-springfield",
    "tags": ["rifle", "30-06", "bolt", "hunting"]
  },
  {
    "text": "The Beretta 92FS is a legendary pistol that has served military and law enforcement for decades. This 9mm semi-automatic pistol features a 15-round magazine capacity and the famous Beretta double/single action trigger system. The open-slide design and chrome-lined barrel ensure reliable performance.",
    "title": "Beretta 92FS 9mm Semi-Automatic Pistol",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/handguns/beretta-92fs-9mm-semi-automatic-pistol",
    "tags": ["pistol", "9mm", "beretta", "black"]
  },
  {
    "text": "The Glock 17 is the original full-size Glock pistol that started it all. This 9mm polymer-framed pistol features a 17-round magazine capacity and the proven Safe Action trigger system. With its lightweight design and corrosion-resistant finish, the G17 is perfect for duty use and personal protection.",
    "title": "Glock 17 Gen5 9mm Semi-Auto Pistol",
    "source": "basspro",
    "url": "https://www.basspro.com/p/glock-17-gen5-9mm-semi-auto-pistol",
    "tags": ["pistol", "9mm", "glock", "polymer"]
  },
  {
    "text": "The Winchester Model 70 is an iconic American hunting rifle known for its controlled round feeding and three-position safety. This .270 Winchester bolt-action rifle features a 24-inch barrel and delivers exceptional accuracy for big game hunting. The M.O.A. trigger system provides precise shot placement.",
    "title": "Winchester Model 70 Featherweight .270 Winchester",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/winchester-model-70-featherweight-270-winchester",
    "tags": ["rifle", "270", "bolt", "hunting"]
  },
  {
    "text": "The Savage 110 series represents modern precision in an affordable package. This .308 Winchester bolt-action rifle features the AccuTrigger system for precise shot placement and a 22-inch barrel for excellent accuracy. The synthetic stock and matte finish make it perfect for all-weather hunting.",
    "title": "Savage 110 Hunter .308 Winchester Bolt-Action Rifle",
    "source": "academy",
    "url": "https://www.academy.com/p/savage-110-hunter-308-winchester-bolt-action-rifle",
    "tags": ["rifle", "308", "bolt", "synthetic"]
  },
  {
    "text": "The Benelli Super Black Eagle 3 is the ultimate waterfowl hunting shotgun. This 12-gauge semi-automatic shotgun features a 28-inch barrel and can handle everything from light target loads to heavy magnum shells. The Comfort-Tech stock reduces felt recoil for all-day shooting comfort.",
    "title": "Benelli Super Black Eagle 3 12 Gauge Semi-Auto Shotgun",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/shotguns/benelli-super-black-eagle-3-12-gauge-semi-auto-shotgun",
    "tags": ["shotgun", "12 gauge", "semi-auto", "waterfowl"]
  },
  {
    "text": "The Colt 1911 Government Model is the classic American pistol that has served for over a century. This .45 ACP single-action pistol features a 5-inch barrel and the traditional 1911 design. With its steel frame and proven reliability, it remains a favorite among collectors and shooters.",
    "title": "Colt 1911 Government Model .45 ACP",
    "source": "basspro",
    "url": "https://www.basspro.com/p/colt-1911-government-model-45-acp",
    "tags": ["pistol", "45 ACP", "1911", "steel"]
  },
  {
    "text": "The Henry Golden Boy is a beautiful lever-action rifle that combines classic American styling with modern manufacturing. This .22 LR rifle features a 20-inch octagonal barrel and a genuine American walnut stock. The brass receiver and buttplate give it a distinctive appearance.",
    "title": "Henry Golden Boy .22 LR Lever-Action Rifle",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/henry-golden-boy-22-lr-lever-action-rifle",
    "tags": ["rifle", "22", "lever", "brass"]
  },
  {
    "text": "The Marlin 336 is a classic American lever-action rifle that has been trusted by hunters for generations. This .30-30 Winchester rifle features a 20-inch barrel and solid top receiver for scope mounting. The checkered American black walnut stock provides a secure grip in all conditions.",
    "title": "Marlin 336 .30-30 Winchester Lever-Action Rifle",
    "source": "academy",
    "url": "https://www.academy.com/p/marlin-336-30-30-winchester-lever-action-rifle",
    "tags": ["rifle", "30-30", "lever", "walnut"]
  },
  {
    "text": "The Springfield Armory XD-M is a modern striker-fired pistol designed for competition and duty use. This 9mm pistol features a 4.5-inch barrel and comes with three interchangeable grip panels. The match-grade barrel and fully adjustable rear sight ensure precision accuracy.",
    "title": "Springfield Armory XD-M 9mm Competition Pistol",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/handguns/springfield-armory-xd-m-9mm-competition-pistol",
    "tags": ["pistol", "9mm", "competition", "striker"]
  },
  {
    "text": "The Tikka T3x is a Finnish-made bolt-action rifle known for its exceptional accuracy right out of the box. This .300 Winchester Magnum rifle features a 24-inch barrel and the smooth T3x action. The synthetic stock is designed for all-weather hunting conditions.",
    "title": "Tikka T3x Hunter .300 Winchester Magnum",
    "source": "basspro",
    "url": "https://www.basspro.com/p/tikka-t3x-hunter-300-winchester-magnum",
    "tags": ["rifle", "300", "bolt", "finnish"]
  },
  {
    "text": "The Weatherby Vanguard is a precision rifle that delivers sub-MOA accuracy at an affordable price. This .270 Winchester bolt-action rifle features a 24-inch barrel and the famous Weatherby guarantee. The Monte Carlo stock and raised cheekpiece provide comfortable shooting.",
    "title": "Weatherby Vanguard .270 Winchester Bolt-Action Rifle",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/weatherby-vanguard-270-winchester-bolt-action-rifle",
    "tags": ["rifle", "270", "bolt", "precision"]
  },
  {
    "text": "The Ruger American Rifle represents exceptional value in a hunting rifle. This .243 Winchester bolt-action rifle features a 22-inch barrel and the Ruger Marksman Adjustable trigger. The synthetic stock and matte finish make it perfect for field use.",
    "title": "Ruger American Rifle .243 Winchester",
    "source": "academy",
    "url": "https://www.academy.com/p/ruger-american-rifle-243-winchester",
    "tags": ["rifle", "243", "bolt", "value"]
  },
  {
    "text": "The CZ 75 is a legendary pistol from the Czech Republic known for its accuracy and reliability. This 9mm pistol features a steel frame and a 4.6-inch barrel. The double/single action trigger system and ergonomic grip make it a favorite among competitive shooters.",
    "title": "CZ 75 B 9mm Semi-Automatic Pistol",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/handguns/cz-75-b-9mm-semi-automatic-pistol",
    "tags": ["pistol", "9mm", "czech", "steel"]
  },
  {
    "text": "The Browning X-Bolt is a modern hunting rifle that combines classic Browning quality with innovative features. This .30-06 Springfield bolt-action rifle features a 22-inch barrel and the Feather Trigger system. The satin walnut stock provides traditional beauty with modern performance.",
    "title": "Browning X-Bolt Hunter .30-06 Springfield",
    "source": "basspro",
    "url": "https://www.basspro.com/p/browning-x-bolt-hunter-30-06-springfield",
    "tags": ["rifle", "30-06", "bolt", "walnut"]
  },
  {
    "text": "The Remington 870 is America's most popular pump-action shotgun, trusted by hunters and law enforcement. This 12-gauge shotgun features a 26-inch barrel with RemChoke system for versatility. The solid steel receiver and twin action bars ensure smooth operation.",
    "title": "Remington 870 Express 12 Gauge Pump-Action Shotgun",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/remington-870-express-12-gauge-pump-action-shotgun",
    "tags": ["shotgun", "12 gauge", "pump", "versatile"]
  },
  {
    "text": "The Kimber 1911 Custom II represents the pinnacle of 1911 craftsmanship. This .45 ACP pistol features a 5-inch match-grade barrel and premium components throughout. The aluminum trigger and match-grade barrel ensure exceptional accuracy.",
    "title": "Kimber 1911 Custom II .45 ACP",
    "source": "academy",
    "url": "https://www.academy.com/p/kimber-1911-custom-ii-45-acp",
    "tags": ["pistol", "45 ACP", "1911", "premium"]
  },
  {
    "text": "The Stoeger M3000 is an affordable semi-automatic shotgun that doesn't compromise on performance. This 12-gauge shotgun features a 28-inch barrel and Inertia Driven system for reliable cycling. The synthetic stock and matte finish make it perfect for waterfowl hunting.",
    "title": "Stoeger M3000 12 Gauge Semi-Auto Shotgun",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/shotguns/stoeger-m3000-12-gauge-semi-auto-shotgun",
    "tags": ["shotgun", "12 gauge", "semi-auto", "affordable"]
  },
  {
    "text": "The Howa 1500 is a Japanese-made bolt-action rifle known for its accuracy and smooth action. This .308 Winchester rifle features a 22-inch barrel and the Howa two-stage trigger. The synthetic stock is designed for durability and all-weather performance.",
    "title": "Howa 1500 .308 Winchester Bolt-Action Rifle",
    "source": "basspro",
    "url": "https://www.basspro.com/p/howa-1500-308-winchester-bolt-action-rifle",
    "tags": ["rifle", "308", "bolt", "japanese"]
  },
  {
    "text": "The Walther PPQ is a German-engineered pistol that combines precision with reliability. This 9mm striker-fired pistol features a 4-inch barrel and the Quick Defense trigger system. The ergonomic grip and ambidextrous controls make it suitable for all shooters.",
    "title": "Walther PPQ 9mm Semi-Automatic Pistol",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/walther-ppq-9mm-semi-automatic-pistol",
    "tags": ["pistol", "9mm", "german", "striker"]
  },
  {
    "text": "The Thompson Center Compass is a budget-friendly bolt-action rifle that delivers premium performance. This .270 Winchester rifle features a 22-inch barrel and adjustable trigger. The composite stock and matte finish make it perfect for hunting in any weather.",
    "title": "Thompson Center Compass .270 Winchester",
    "source": "academy",
    "url": "https://www.academy.com/p/thompson-center-compass-270-winchester",
    "tags": ["rifle", "270", "bolt", "budget"]
  },
  {
    "text": "The Beretta A400 is a premium semi-automatic shotgun designed for high-volume shooting. This 12-gauge shotgun features a 28-inch barrel and the Blink gas system for fast cycling. The Kick-Off recoil reduction system makes it comfortable to shoot all day.",
    "title": "Beretta A400 Xtreme Plus 12 Gauge Semi-Auto Shotgun",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/shotguns/beretta-a400-xtreme-plus-12-gauge-semi-auto-shotgun",
    "tags": ["shotgun", "12 gauge", "semi-auto", "premium"]
  },
  {
    "text": "The Ruger SR1911 combines classic 1911 styling with modern manufacturing techniques. This .45 ACP pistol features a 5-inch barrel and all-steel construction. The Series 70 firing system and extended thumb safety provide reliable operation.",
    "title": "Ruger SR1911 .45 ACP 1911 Pistol",
    "source": "basspro",
    "url": "https://www.basspro.com/p/ruger-sr1911-45-acp-1911-pistol",
    "tags": ["pistol", "45 ACP", "1911", "ruger"]
  },
  {
    "text": "The Savage Axis is an entry-level bolt-action rifle that offers exceptional value. This .243 Winchester rifle features a 22-inch barrel and the AccuTrigger system. The synthetic stock and matte finish make it perfect for new hunters.",
    "title": "Savage Axis .243 Winchester Bolt-Action Rifle",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/savage-axis-243-winchester-bolt-action-rifle",
    "tags": ["rifle", "243", "bolt", "entry"]
  },
  {
    "text": "The FN 509 is a modern striker-fired pistol designed for professional use. This 9mm pistol features a 4-inch barrel and ambidextrous controls. The interchangeable backstraps and low-profile sights make it suitable for concealed carry.",
    "title": "FN 509 9mm Striker-Fired Pistol",
    "source": "academy",
    "url": "https://www.academy.com/p/fn-509-9mm-striker-fired-pistol",
    "tags": ["pistol", "9mm", "striker", "professional"]
  },
  {
    "text": "The Bergara B-14 is a Spanish-made precision rifle that delivers exceptional accuracy. This 6.5 Creedmoor bolt-action rifle features a 24-inch barrel and the Bergara action. The synthetic stock and matte finish make it perfect for long-range shooting.",
    "title": "Bergara B-14 Hunter 6.5 Creedmoor",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/rifles/bergara-b-14-hunter-65-creedmoor",
    "tags": ["rifle", "6.5 creedmoor", "bolt", "precision"]
  },
  {
    "text": "The Winchester SXP is a reliable pump-action shotgun that offers smooth operation at an affordable price. This 12-gauge shotgun features a 28-inch barrel and the Speed Pump action. The synthetic stock and matte finish make it perfect for hunting and sport shooting.",
    "title": "Winchester SXP 12 Gauge Pump-Action Shotgun",
    "source": "basspro",
    "url": "https://www.basspro.com/p/winchester-sxp-12-gauge-pump-action-shotgun",
    "tags": ["shotgun", "12 gauge", "pump", "reliable"]
  },
  {
    "text": "The Canik TP9 is a Turkish-made pistol that offers exceptional value and performance. This 9mm striker-fired pistol features a 4.07-inch barrel and comes with multiple magazine options. The Warren Tactical sights and match-grade barrel ensure accuracy.",
    "title": "Canik TP9 Elite SC 9mm Compact Pistol",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/canik-tp9-elite-sc-9mm-compact-pistol",
    "tags": ["pistol", "9mm", "turkish", "compact"]
  },
  {
    "text": "The Christensen Arms Ridgeline is a premium hunting rifle that combines carbon fiber technology with precision engineering. This .300 Winchester Magnum bolt-action rifle features a 24-inch carbon fiber barrel and titanium action. The carbon fiber stock reduces weight while maintaining strength.",
    "title": "Christensen Arms Ridgeline .300 Winchester Magnum",
    "source": "academy",
    "url": "https://www.academy.com/p/christensen-arms-ridgeline-300-winchester-magnum",
    "tags": ["rifle", "300", "bolt", "carbon"]
  },
  {
    "text": "The Ithaca 37 is a classic American pump-action shotgun known for its unique bottom-loading design. This 12-gauge shotgun features a 28-inch barrel and the traditional Ithaca action. The walnut stock and blued finish give it a timeless appearance.",
    "title": "Ithaca 37 Featherlight 12 Gauge Pump Shotgun",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/shotguns/ithaca-37-featherlight-12-gauge-pump-shotgun",
    "tags": ["shotgun", "12 gauge", "pump", "classic"]
  },
  {
    "text": "The Taurus G3 is an affordable striker-fired pistol that offers reliability and performance. This 9mm pistol features a 4-inch barrel and comes with two magazines. The ergonomic grip and manual safety make it suitable for new shooters.",
    "title": "Taurus G3 9mm Semi-Automatic Pistol",
    "source": "basspro",
    "url": "https://www.basspro.com/p/taurus-g3-9mm-semi-automatic-pistol",
    "tags": ["pistol", "9mm", "affordable", "striker"]
  },
  {
    "text": "The Nosler M48 is a premium hunting rifle built on the Model 48 action. This .280 Ackley Improved bolt-action rifle features a 24-inch barrel and premium components throughout. The walnut stock and match-grade barrel ensure exceptional accuracy.",
    "title": "Nosler M48 Trophy .280 Ackley Improved",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/nosler-m48-trophy-280-ackley-improved",
    "tags": ["rifle", "280", "bolt", "premium"]
  },
  {
    "text": "The Franchi Affinity 3 is a reliable semi-automatic shotgun designed for versatility. This 12-gauge shotgun features a 28-inch barrel and the Inertia Driven system. The synthetic stock and red fiber optic sight make it perfect for hunting and sport shooting.",
    "title": "Franchi Affinity 3 12 Gauge Semi-Auto Shotgun",
    "source": "academy",
    "url": "https://www.academy.com/p/franchi-affinity-3-12-gauge-semi-auto-shotgun",
    "tags": ["shotgun", "12 gauge", "semi-auto", "versatile"]
  },
  {
    "text": "The H&K VP9 is a German-engineered striker-fired pistol that sets the standard for ergonomics and reliability. This 9mm pistol features a 4.09-inch barrel and the VP trigger system. The interchangeable grip panels and ambidextrous controls make it suitable for all shooters.",
    "title": "H&K VP9 9mm Striker-Fired Pistol",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/handguns/hk-vp9-9mm-striker-fired-pistol",
    "tags": ["pistol", "9mm", "german", "ergonomic"]
  },
  {
    "text": "The Cooper Firearms Model 52 is a precision rifle handcrafted in Montana. This .22-250 Remington bolt-action rifle features a 24-inch barrel and the Cooper action. The AA-grade walnut stock and premium components ensure exceptional accuracy.",
    "title": "Cooper Firearms Model 52 .22-250 Remington",
    "source": "basspro",
    "url": "https://www.basspro.com/p/cooper-firearms-model-52-22-250-remington",
    "tags": ["rifle", "22-250", "bolt", "handcrafted"]
  },
  {
    "text": "The Tristar TT-15 is an affordable over/under shotgun that offers traditional styling and reliable performance. This 12-gauge shotgun features 28-inch barrels and extractors. The walnut stock and case-hardened receiver give it a classic appearance.",
    "title": "Tristar TT-15 12 Gauge Over/Under Shotgun",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/tristar-tt-15-12-gauge-over-under-shotgun",
    "tags": ["shotgun", "12 gauge", "over under", "traditional"]
  },
  {
    "text": "The Sig Sauer P226 is a legendary pistol that has served military and law enforcement worldwide. This 9mm pistol features a 4.4-inch barrel and the proven DA/SA trigger system. The alloy frame and stainless steel slide provide durability and corrosion resistance.",
    "title": "Sig Sauer P226 9mm Semi-Automatic Pistol",
    "source": "academy",
    "url": "https://www.academy.com/p/sig-sauer-p226-9mm-semi-automatic-pistol",
    "tags": ["pistol", "9mm", "sig", "legendary"]
  },
  {
    "text": "The Ruger Hawkeye is a classic bolt-action rifle that combines traditional styling with modern performance. This .30-06 Springfield rifle features a 22-inch barrel and the LC6 trigger system. The American walnut stock and matte stainless finish make it perfect for hunting.",
    "title": "Ruger Hawkeye .30-06 Springfield Bolt-Action Rifle",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/rifles/ruger-hawkeye-30-06-springfield-bolt-action-rifle",
    "tags": ["rifle", "30-06", "bolt", "classic"]
  },
  {
    "text": "The Benelli Montefeltro is a lightweight semi-automatic shotgun perfect for upland hunting. This 12-gauge shotgun features a 26-inch barrel and the Inertia Driven system. The checkered walnut stock and nickel-plated receiver give it an elegant appearance.",
    "title": "Benelli Montefeltro 12 Gauge Semi-Auto Shotgun",
    "source": "basspro",
    "url": "https://www.basspro.com/p/benelli-montefeltro-12-gauge-semi-auto-shotgun",
    "tags": ["shotgun", "12 gauge", "semi-auto", "upland"]
  },
  {
    "text": "The Wilson Combat EDC X9 is a premium 1911-style pistol designed for everyday carry. This 9mm pistol features a 4-inch barrel and premium components throughout. The X-Tac pattern and round butt frame provide excellent ergonomics.",
    "title": "Wilson Combat EDC X9 9mm Compact Pistol",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/wilson-combat-edc-x9-9mm-compact-pistol",
    "tags": ["pistol", "9mm", "1911", "premium"]
  },
  {
    "text": "The Mauser M18 is a German-engineered bolt-action rifle that offers precision at an affordable price. This 6.5 Creedmoor rifle features a 22-inch barrel and the Mauser action. The synthetic stock and matte finish make it perfect for hunting and target shooting.",
    "title": "Mauser M18 6.5 Creedmoor Bolt-Action Rifle",
    "source": "academy",
    "url": "https://www.academy.com/p/mauser-m18-65-creedmoor-bolt-action-rifle",
    "tags": ["rifle", "6.5 creedmoor", "bolt", "german"]
  },
  {
    "text": "The Perazzi MX12 is a premium over/under shotgun designed for competitive shooting. This 12-gauge shotgun features 30-inch barrels and the Perazzi action. The adjustable stock and premium components make it perfect for trap and skeet shooting.",
    "title": "Perazzi MX12 12 Gauge Over/Under Competition Shotgun",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/shotguns/perazzi-mx12-12-gauge-over-under-competition-shotgun",
    "tags": ["shotgun", "12 gauge", "over under", "competition"]
  },
  {
    "text": "The Nighthawk Custom GRP is a premium 1911 pistol built to the highest standards. This .45 ACP pistol features a 5-inch barrel and hand-fitted components. The GRP frame and slide are machined from solid steel for maximum durability.",
    "title": "Nighthawk Custom GRP .45 ACP 1911 Pistol",
    "source": "basspro",
    "url": "https://www.basspro.com/p/nighthawk-custom-grp-45-acp-1911-pistol",
    "tags": ["pistol", "45 ACP", "1911", "custom"]
  },
  {
    "text": "The Sauer 100 is a German-made bolt-action rifle that combines quality with affordability. This .308 Winchester rifle features a 22-inch barrel and the Sauer action. The synthetic stock and matte finish make it perfect for hunting in all conditions.",
    "title": "Sauer 100 .308 Winchester Bolt-Action Rifle",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/sauer-100-308-winchester-bolt-action-rifle",
    "tags": ["rifle", "308", "bolt", "quality"]
  },
  {
    "text": "The Fabarm XLR5 is an innovative semi-automatic shotgun designed for competitive shooting. This 12-gauge shotgun features a 30-inch barrel and the Pulse Piston system. The adjustable stock and fiber optic sights make it perfect for sporting clays.",
    "title": "Fabarm XLR5 Velocity 12 Gauge Semi-Auto Shotgun",
    "source": "academy",
    "url": "https://www.academy.com/p/fabarm-xlr5-velocity-12-gauge-semi-auto-shotgun",
    "tags": ["shotgun", "12 gauge", "semi-auto", "competitive"]
  },
  {
    "text": "The Colt Python is an iconic revolver that has been reintroduced with modern manufacturing. This .357 Magnum revolver features a 4.25-inch barrel and the famous Python action. The stainless steel construction and target sights make it perfect for both hunting and target shooting.",
    "title": "Colt Python .357 Magnum Revolver",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/handguns/colt-python-357-magnum-revolver",
    "tags": ["revolver", "357", "stainless", "iconic"]
  },
  {
    "text": "The Blaser R8 is a revolutionary straight-pull bolt-action rifle that offers lightning-fast follow-up shots. This .300 Winchester Magnum rifle features a 23-inch barrel and the Blaser action. The synthetic stock and barrel system allow for quick caliber changes.",
    "title": "Blaser R8 Success .300 Winchester Magnum",
    "source": "basspro",
    "url": "https://www.basspro.com/p/blaser-r8-success-300-winchester-magnum",
    "tags": ["rifle", "300", "straight pull", "revolutionary"]
  },
  {
    "text": "The Krieghoff K-80 is a premium over/under shotgun designed for the most demanding shooters. This 12-gauge shotgun features 30-inch barrels and the Krieghoff action. The adjustable stock and premium components make it the choice of champions.",
    "title": "Krieghoff K-80 12 Gauge Over/Under Shotgun",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/krieghoff-k-80-12-gauge-over-under-shotgun",
    "tags": ["shotgun", "12 gauge", "over under", "champion"]
  },
  {
    "text": "The Glock 19X is a unique crossover pistol that combines the best features of different Glock models. This 9mm pistol features a 4.02-inch barrel and the Glock Marksman Barrel. The Coyote finish and lanyard loop make it perfect for duty use.",
    "title": "Glock 19X 9mm Crossover Pistol",
    "source": "academy",
    "url": "https://www.academy.com/p/glock-19x-9mm-crossover-pistol",
    "tags": ["pistol", "9mm", "crossover", "duty"]
  },
  {
    "text": "The Accuracy International AT is a precision rifle system used by military and law enforcement worldwide. This .308 Winchester bolt-action rifle features a 24-inch barrel and the AI action. The folding stock and quick-detach barrel system make it perfect for tactical applications.",
    "title": "Accuracy International AT .308 Winchester",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/rifles/accuracy-international-at-308-winchester",
    "tags": ["rifle", "308", "bolt", "tactical"]
  },
  {
    "text": "The Remington 1100 is a classic semi-automatic shotgun that has been trusted by hunters for decades. This 12-gauge shotgun features a 26-inch barrel and the gas-operated action. The walnut stock and blued finish give it a traditional appearance.",
    "title": "Remington 1100 12 Gauge Semi-Auto Shotgun",
    "source": "basspro",
    "url": "https://www.basspro.com/p/remington-1100-12-gauge-semi-auto-shotgun",
    "tags": ["shotgun", "12 gauge", "semi-auto", "classic"]
  },
  {
    "text": "The Desert Eagle is an iconic large-frame semi-automatic pistol chambered in magnum cartridges. This .44 Magnum pistol features a 6-inch barrel and gas-operated action. The Desert Eagle finish and distinctive appearance make it instantly recognizable.",
    "title": "Desert Eagle .44 Magnum Semi-Auto Pistol",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/desert-eagle-44-magnum-semi-auto-pistol",
    "tags": ["pistol", "44 magnum", "large frame", "iconic"]
  },
  {
    "text": "The Barrett M82A1 is a legendary .50 BMG semi-automatic rifle used by military forces worldwide. This anti-materiel rifle features a 29-inch barrel and the Barrett action. The muzzle brake and recoil system make this powerful cartridge manageable.",
    "title": "Barrett M82A1 .50 BMG Semi-Auto Rifle",
    "source": "academy",
    "url": "https://www.academy.com/p/barrett-m82a1-50-bmg-semi-auto-rifle",
    "tags": ["rifle", "50 BMG", "semi-auto", "anti-materiel"]
  },
  {
    "text": "The Steyr AUG is a bullpup rifle that revolutionized military small arms design. This 5.56 NATO rifle features a 20-inch barrel and the AUG action. The integrated optic and ambidextrous design make it suitable for all shooters.",
    "title": "Steyr AUG A3 M1 5.56 NATO Bullpup Rifle",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/rifles/steyr-aug-a3-m1-556-nato-bullpup-rifle",
    "tags": ["rifle", "556", "bullpup", "revolutionary"]
  },
  {
    "text": "The Sako 85 is a Finnish-made bolt-action rifle known for its exceptional accuracy and smooth action. This .270 Winchester rifle features a 22.4-inch barrel and the Sako action. The walnut stock and blued finish give it a classic European appearance.",
    "title": "Sako 85 Hunter .270 Winchester",
    "source": "basspro",
    "url": "https://www.basspro.com/p/sako-85-hunter-270-winchester",
    "tags": ["rifle", "270", "bolt", "finnish"]
  },
  {
    "text": "The Chiappa Rhino is a unique revolver that fires from the bottom cylinder chamber. This .357 Magnum revolver features a 4-inch barrel and the Rhino action. The unique design reduces muzzle flip and felt recoil for faster follow-up shots.",
    "title": "Chiappa Rhino .357 Magnum Revolver",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/chiappa-rhino-357-magnum-revolver",
    "tags": ["revolver", "357", "unique", "innovative"]
  },
  {
    "text": "The Mossberg 590 is a tactical pump-action shotgun designed for law enforcement and military use. This 12-gauge shotgun features an 18.5-inch barrel and the Mossberg action. The ghost ring sights and tactical stock make it perfect for defensive applications.",
    "title": "Mossberg 590 Tactical 12 Gauge Pump Shotgun",
    "source": "academy",
    "url": "https://www.academy.com/p/mossberg-590-tactical-12-gauge-pump-shotgun",
    "tags": ["shotgun", "12 gauge", "pump", "tactical"]
  },
  {
    "text": "The Anschutz 1416 is a German-made precision .22 rifle perfect for target shooting and small game hunting. This .22 LR bolt-action rifle features a 22-inch barrel and the Anschutz action. The two-stage trigger and walnut stock ensure exceptional accuracy.",
    "title": "Anschutz 1416 .22 LR Bolt-Action Rifle",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/rifles/anschutz-1416-22-lr-bolt-action-rifle",
    "tags": ["rifle", "22", "bolt", "precision"]
  },
  {
    "text": "The Tavor X95 is an Israeli bullpup rifle that combines compact size with full-length barrel performance. This 5.56 NATO rifle features an 18.5-inch barrel and the Tavor action. The ambidextrous controls and rail system make it highly adaptable.",
    "title": "IWI Tavor X95 5.56 NATO Bullpup Rifle",
    "source": "basspro",
    "url": "https://www.basspro.com/p/iwi-tavor-x95-556-nato-bullpup-rifle",
    "tags": ["rifle", "556", "bullpup", "israeli"]
  },
  {
    "text": "The Savage 220 is a dedicated slug gun designed for deer hunting in shotgun-only zones. This 20-gauge bolt-action shotgun features a 22-inch barrel and the AccuTrigger system. The synthetic stock and matte finish make it perfect for hunting.",
    "title": "Savage 220 20 Gauge Slug Gun",
    "source": "palmettostatearmory",
    "url": "https://palmettostatearmory.com/savage-220-20-gauge-slug-gun",
    "tags": ["shotgun", "20 gauge", "slug", "deer"]
  },
  {
    "text": "The Korth NXA is a premium German revolver that represents the pinnacle of engineering and craftsmanship. This .357 Magnum revolver features a 4-inch barrel and the Korth action. The interchangeable cylinders and premium materials make it a collector's dream.",
    "title": "Korth NXA .357 Magnum Revolver",
    "source": "academy",
    "url": "https://www.academy.com/p/korth-nxa-357-magnum-revolver",
    "tags": ["revolver", "357", "german", "premium"]
  },
  {
    "text": "The Volquartsen Summit is a precision .22 rifle built for competition and accuracy. This .22 LR semi-automatic rifle features a 20-inch barrel and the Volquartsen action. The carbon fiber stock and match-grade components ensure exceptional performance.",
    "title": "Volquartsen Summit .22 LR Competition Rifle",
    "source": "sportsmans",
    "url": "https://www.sportsmans.com/shooting-gear-gun-supplies/rifles/volquartsen-summit-22-lr-competition-rifle",
    "tags": ["rifle", "22", "semi-auto", "competition"]
  },
  {
    "text": "The Browning Citori is a classic over/under shotgun that has been a favorite among hunters and clay shooters for decades. This 12-gauge shotgun features 28-inch barrels and the Citori action. The walnut stock and silver nitride finish give it timeless appeal.",
    "title": "Browning Citori 12 Gauge Over/Under Shotgun",
    "source": "basspro",
    "url": "https://www.basspro.com/p/browning-citori-12-gauge-over-under-shotgun",
    "tags": ["shotgun", "12 gauge", "over under", "classic"]
  }
]
